# -*- coding:utf-8 -*-

'''
成績登錄查詢系統參數配置
Version： v1.0

Date：2019-05-23
author： 李俊諭
'''

''' 學生資料目錄 '''
stu_dict = {
    'A01': {'Name': 'Tom', '國文': 50, '英文': 65, '數學': 70, '社會': 85},
    'A02': {'Name': 'Allen', '國文': 90, '英文': 85, '數學': 72, '社會': 66},
    'A03': {'Name': 'Ben', '國文': 80, '英文': 76, '數學': 52, '社會': 45},
    'A04': {'Name': 'Mary', '國文': 30, '英文': 75, '數學': 92, '社會': 95},
    'A05': {'Name': 'Jack', '國文': 88, '英文': 67, '數學': 77, '社會': 68},
}


''' 第一層大項項目 '''
first_option = {
    1:'登錄學生資訊包含成績資料',
    2:'查詢學生成績',
    3:'查詢學生總平均',
    4:'離開本系統'
}
